content/notes/20210107221817-emacs.md
+++
title = "Emacs"
author = ["Бадыков Айрат"]
lastmod = 2021-09-02T21:45:52+03:00
draft = false
+++

Emacs is an (esoteric) text editor. Its key feature is extensibility. Emacs provides Emacs Lisp programming language which is used to write extensions.

Great Emacs packages:

-   [Magit](https://magit.vc/) - a git interface
-   [Org-Mode]({{<relref "20210831195358-org_mode.md#" >}}) is a document editing, formatting, and organizing mode
-   [Org-Roam]({{<relref "20210831213556-org_roam.md#" >}}) is a personal knowledge management tool

You can check out [my blog post](https://www.badykov.com/emacs/2018/07/31/why-emacs-is-a-great-editor/) I wrote a long time ago where I'm trying to sell Emacs.

My emacs config can be found in [the github repo](https://github.com/ayrat555/dot-emacs)

The only problem I have with Emacs is it drains my free time :)

I wrote several [emacs packages]({{<relref "20210901190330-my_emacs_projects.md#" >}})


## My emacs configuration backlog: {#my-emacs-configuration-backlog}

-   Start emacs server on macos boot
    Creating plist and additing \`Library/LaunchAgents\` starts two daemons, using just \`em ./\` starts one daemon

-   Set up org-capture shortcuts from anywhere
    using org-protocol

-   Figure out / clean types of notes

    I think content to consume  should only have main type notes, without notes for separate movies etc

-   Emacs creates garbage files in home directory

-   Try org-super-agenda
    <https://github.com/alphapapa/org-super-agenda>

<!--listend-->

-   Check <https://github.com/progfolio/doct>

-   Check <https://github.com/manateelazycat/snails>

-   Fix org-journal agenda for new files

-   Make long lines separated in the compilation mode separated


## Backlog for this note {#backlog-for-this-note}

-   Add emacs packages that I use
